# Берем легкий официальный образ Python
FROM python:3.11-slim
# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app
# Копируем файл с зависимостями ПЕРВЫМ (это использует кеширование слоев Docker)
COPY requirements.txt .
# Устанавливаем зависимости внутри контейнера
RUN pip install --no-cache-dir -r requirements.txt
# Копируем ВСЕ остальные файлы из текущей папки компьютера в папку /app внутри контейнера
COPY . .
# Открываем порт 8000 наружу
EXPOSE 8000
# Команда для запуска сервера при старте контейнера
# - host=0.0.0.0 нужно, чтобы контейнер принимал запросы извне
CMD ["uvicorn", "app:app", "--host", "0.0.0.0", "--port", "8000"]